docs: cleaner architecture diagram in README
